; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-5-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	p0-8 - location
	p0-9 - location
	p2-1 - location
	p2-7 - location
	p3-5 - location
	p4-8 - location
	p6-4 - location
	p6-9 - location
	p7-1 - location
	p7-4 - location
	p7-5 - location
	p8-2 - location
	p8-6 - location
	p9-0 - location
	p9-7 - location
	p9-10 - location
	p10-3 - location
	p10-4 - location
	p10-7 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s10)
	(at driver3 s0)
	(at driver4 s0)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s7)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s6)
	(empty truck5)
	(at package1 s5)
	(at package2 s0)
	(at package3 s0)
	(at package4 s8)
	(at package5 s1)
	(at package6 s8)
	(at package7 s4)
	(at package8 s0)
	(at package9 s3)
	(path s0 p0-8)
	(path p0-8 s0)
	(path s8 p0-8)
	(path p0-8 s8)
	(= (time-to-walk s0 p0-8) 47)
	(= (time-to-walk p0-8 s0) 47)
	(= (time-to-walk s8 p0-8) 42)
	(= (time-to-walk p0-8 s8) 42)
	(path s0 p0-9)
	(path p0-9 s0)
	(path s9 p0-9)
	(path p0-9 s9)
	(= (time-to-walk s0 p0-9) 49)
	(= (time-to-walk p0-9 s0) 49)
	(= (time-to-walk s9 p0-9) 38)
	(= (time-to-walk p0-9 s9) 38)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 93)
	(= (time-to-walk p2-1 s2) 93)
	(= (time-to-walk s1 p2-1) 94)
	(= (time-to-walk p2-1 s1) 94)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(= (time-to-walk s2 p2-7) 15)
	(= (time-to-walk p2-7 s2) 15)
	(= (time-to-walk s7 p2-7) 98)
	(= (time-to-walk p2-7 s7) 98)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 78)
	(= (time-to-walk p3-5 s3) 78)
	(= (time-to-walk s5 p3-5) 22)
	(= (time-to-walk p3-5 s5) 22)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(= (time-to-walk s4 p4-8) 5)
	(= (time-to-walk p4-8 s4) 5)
	(= (time-to-walk s8 p4-8) 58)
	(= (time-to-walk p4-8 s8) 58)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 71)
	(= (time-to-walk p6-4 s6) 71)
	(= (time-to-walk s4 p6-4) 80)
	(= (time-to-walk p6-4 s4) 80)
	(path s6 p6-9)
	(path p6-9 s6)
	(path s9 p6-9)
	(path p6-9 s9)
	(= (time-to-walk s6 p6-9) 43)
	(= (time-to-walk p6-9 s6) 43)
	(= (time-to-walk s9 p6-9) 50)
	(= (time-to-walk p6-9 s9) 50)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(= (time-to-walk s7 p7-1) 96)
	(= (time-to-walk p7-1 s7) 96)
	(= (time-to-walk s1 p7-1) 36)
	(= (time-to-walk p7-1 s1) 36)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(= (time-to-walk s7 p7-4) 99)
	(= (time-to-walk p7-4 s7) 99)
	(= (time-to-walk s4 p7-4) 78)
	(= (time-to-walk p7-4 s4) 78)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(= (time-to-walk s7 p7-5) 92)
	(= (time-to-walk p7-5 s7) 92)
	(= (time-to-walk s5 p7-5) 89)
	(= (time-to-walk p7-5 s5) 89)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(= (time-to-walk s8 p8-2) 21)
	(= (time-to-walk p8-2 s8) 21)
	(= (time-to-walk s2 p8-2) 17)
	(= (time-to-walk p8-2 s2) 17)
	(path s8 p8-6)
	(path p8-6 s8)
	(path s6 p8-6)
	(path p8-6 s6)
	(= (time-to-walk s8 p8-6) 19)
	(= (time-to-walk p8-6 s8) 19)
	(= (time-to-walk s6 p8-6) 23)
	(= (time-to-walk p8-6 s6) 23)
	(path s9 p9-7)
	(path p9-7 s9)
	(path s7 p9-7)
	(path p9-7 s7)
	(= (time-to-walk s9 p9-7) 83)
	(= (time-to-walk p9-7 s9) 83)
	(= (time-to-walk s7 p9-7) 39)
	(= (time-to-walk p9-7 s7) 39)
	(path s9 p9-10)
	(path p9-10 s9)
	(path s10 p9-10)
	(path p9-10 s10)
	(= (time-to-walk s9 p9-10) 51)
	(= (time-to-walk p9-10 s9) 51)
	(= (time-to-walk s10 p9-10) 68)
	(= (time-to-walk p9-10 s10) 68)
	(path s10 p10-3)
	(path p10-3 s10)
	(path s3 p10-3)
	(path p10-3 s3)
	(= (time-to-walk s10 p10-3) 19)
	(= (time-to-walk p10-3 s10) 19)
	(= (time-to-walk s3 p10-3) 97)
	(= (time-to-walk p10-3 s3) 97)
	(path s10 p10-4)
	(path p10-4 s10)
	(path s4 p10-4)
	(path p10-4 s4)
	(= (time-to-walk s10 p10-4) 10)
	(= (time-to-walk p10-4 s10) 10)
	(= (time-to-walk s4 p10-4) 67)
	(= (time-to-walk p10-4 s4) 67)
	(path s10 p10-7)
	(path p10-7 s10)
	(path s7 p10-7)
	(path p10-7 s7)
	(= (time-to-walk s10 p10-7) 35)
	(= (time-to-walk p10-7 s10) 35)
	(= (time-to-walk s7 p10-7) 2)
	(= (time-to-walk p10-7 s7) 2)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 61)
	(= (time-to-drive s4 s0) 61)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 50)
	(= (time-to-drive s7 s0) 50)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 99)
	(= (time-to-drive s8 s0) 99)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 39)
	(= (time-to-drive s9 s0) 39)
	(link s0 s10)
	(link s10 s0)
	(= (time-to-drive s0 s10) 72)
	(= (time-to-drive s10 s0) 72)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 3)
	(= (time-to-drive s0 s1) 3)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 96)
	(= (time-to-drive s3 s1) 96)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 43)
	(= (time-to-drive s6 s1) 43)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 83)
	(= (time-to-drive s6 s2) 83)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 38)
	(= (time-to-drive s10 s2) 38)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 93)
	(= (time-to-drive s0 s3) 93)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 78)
	(= (time-to-drive s5 s3) 78)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 74)
	(= (time-to-drive s6 s3) 74)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 92)
	(= (time-to-drive s5 s4) 92)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 55)
	(= (time-to-drive s9 s4) 55)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 66)
	(= (time-to-drive s6 s5) 66)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 80)
	(= (time-to-drive s8 s5) 80)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 75)
	(= (time-to-drive s1 s7) 75)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 82)
	(= (time-to-drive s2 s7) 82)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 98)
	(= (time-to-drive s5 s7) 98)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 98)
	(= (time-to-drive s6 s7) 98)
	(link s7 s10)
	(link s10 s7)
	(= (time-to-drive s7 s10) 64)
	(= (time-to-drive s10 s7) 64)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 36)
	(= (time-to-drive s1 s8) 36)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 48)
	(= (time-to-drive s7 s8) 48)
	(link s10 s3)
	(link s3 s10)
	(= (time-to-drive s10 s3) 32)
	(= (time-to-drive s3 s10) 32)
	(link s10 s4)
	(link s4 s10)
	(= (time-to-drive s10 s4) 54)
	(= (time-to-drive s4 s10) 54)
	(link s10 s8)
	(link s8 s10)
	(= (time-to-drive s10 s8) 45)
	(= (time-to-drive s8 s10) 45)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s4)
	(at driver3 s3)
	(at driver4 s7)
	(at truck1 s4)
	(at truck2 s4)
	(at truck5 s7)
	(at package1 s4)
	(at package2 s9)
	(at package3 s8)
	(at package4 s9)
	(at package5 s10)
	(at package6 s6)
	(at package7 s2)
	(at package8 s7)
	(at package9 s9)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 1  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver1 truck3 s4)
   deleted: (at driver1 s4) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 0 of 15
2. (drive-truck truck3 s4 s9 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s9)
   changed: (driven) from 0 to 55
   goals met: 0 of 15
3. (walk driver2 s10 p10-4)
   deleted: (at driver2 s10)
   added: (at driver2 p10-4)
   changed: (walked) from 0 to 10
   goals met: 0 of 15
4. (walk driver2 p10-4 s4)
   deleted: (at driver2 p10-4)
   added: (at driver2 s4)
   changed: (walked) from 10 to 77
   goals met: 1 of 15
5. (walk driver2 s4 p6-4)
   deleted: (at driver2 s4)
   added: (at driver2 p6-4)
   changed: (walked) from 77 to 157
   goals met: 0 of 15
6. (drive-truck truck3 s9 s4 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s4)
   changed: (driven) from 55 to 110
   goals met: 0 of 15
7. (load-truck package7 truck3 s4)
   deleted: (at package7 s4)
   added: (in package7 truck3)
   goals met: 0 of 15
8. (drive-truck truck3 s4 s10 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s10)
   changed: (driven) from 110 to 164
   goals met: 0 of 15
9. (drive-truck truck3 s10 s7 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s7)
   changed: (driven) from 164 to 228
   goals met: 0 of 15
10. (walk driver2 p6-4 s6)
   deleted: (at driver2 p6-4)
   added: (at driver2 s6)
   changed: (walked) from 157 to 228
   goals met: 0 of 15
11. (board-truck driver2 truck1 s6)
   deleted: (at driver2 s6) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 0 of 15
12. (drive-truck truck3 s7 s0 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s0)
   changed: (driven) from 228 to 278
   goals met: 0 of 15
13. (load-truck package2 truck3 s0)
   deleted: (at package2 s0)
   added: (in package2 truck3)
   goals met: 0 of 15
14. (load-truck package3 truck3 s0)
   deleted: (at package3 s0)
   added: (in package3 truck3)
   goals met: 0 of 15
15. (load-truck package8 truck3 s0)
   deleted: (at package8 s0)
   added: (in package8 truck3)
   goals met: 0 of 15
16. (drive-truck truck1 s6 s5 driver2)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   changed: (driven) from 278 to 344
   goals met: 0 of 15
17. (load-truck package1 truck1 s5)
   deleted: (at package1 s5)
   added: (in package1 truck1)
   goals met: 0 of 15
18. (drive-truck truck3 s0 s1 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 344 to 347
   goals met: 0 of 15
19. (load-truck package5 truck3 s1)
   deleted: (at package5 s1)
   added: (in package5 truck3)
   goals met: 0 of 15
20. (drive-truck truck3 s1 s0 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (driven) from 347 to 350
   goals met: 0 of 15
21. (drive-truck truck3 s0 s10 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s10)
   changed: (driven) from 350 to 422
   goals met: 0 of 15
22. (drive-truck truck1 s5 s6 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   changed: (driven) from 422 to 488
   goals met: 0 of 15
23. (unload-truck package5 truck3 s10)
   deleted: (in package5 truck3)
   added: (at package5 s10)
   goals met: 1 of 15
24. (drive-truck truck3 s10 s8 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s8)
   changed: (driven) from 488 to 533
   goals met: 1 of 15
25. (load-truck package4 truck3 s8)
   deleted: (at package4 s8)
   added: (in package4 truck3)
   goals met: 1 of 15
26. (drive-truck truck3 s8 s7 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s7)
   changed: (driven) from 533 to 581
   goals met: 1 of 15
27. (unload-truck package8 truck3 s7)
   deleted: (in package8 truck3)
   added: (at package8 s7)
   goals met: 2 of 15
28. (drive-truck truck3 s7 s8 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s8)
   changed: (driven) from 581 to 629
   goals met: 2 of 15
29. (unload-truck package3 truck3 s8)
   deleted: (in package3 truck3)
   added: (at package3 s8)
   goals met: 3 of 15
30. (load-truck package6 truck3 s8)
   deleted: (at package6 s8)
   added: (in package6 truck3)
   goals met: 3 of 15
31. (drive-truck truck3 s8 s10 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s10)
   changed: (driven) from 629 to 674
   goals met: 3 of 15
32. (drive-truck truck1 s6 s5 driver2)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   changed: (driven) from 674 to 740
   goals met: 3 of 15
33. (drive-truck truck1 s5 s4 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   changed: (driven) from 740 to 832
   goals met: 4 of 15
34. (disembark-truck driver2 truck1 s4)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 5 of 15
35. (walk driver2 s4 p7-4)
   deleted: (at driver2 s4)
   added: (at driver2 p7-4)
   changed: (walked) from 228 to 306
   goals met: 4 of 15
36. (unload-truck package1 truck1 s4)
   deleted: (in package1 truck1)
   added: (at package1 s4)
   goals met: 5 of 15
37. (drive-truck truck3 s10 s3 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s3)
   changed: (driven) from 832 to 864
   goals met: 5 of 15
38. (load-truck package9 truck3 s3)
   deleted: (at package9 s3)
   added: (in package9 truck3)
   goals met: 5 of 15
39. (disembark-truck driver1 truck3 s3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s3) (empty truck3)
   goals met: 5 of 15
40. (walk driver4 s0 p0-9)
   deleted: (at driver4 s0)
   added: (at driver4 p0-9)
   changed: (walked) from 306 to 355
   goals met: 5 of 15
41. (walk driver4 p0-9 s9)
   deleted: (at driver4 p0-9)
   added: (at driver4 s9)
   changed: (walked) from 355 to 393
   goals met: 5 of 15
42. (walk driver2 p7-4 s4)
   deleted: (at driver2 p7-4)
   added: (at driver2 s4)
   changed: (walked) from 393 to 471
   goals met: 6 of 15
43. (walk driver4 s9 p9-7)
   deleted: (at driver4 s9)
   added: (at driver4 p9-7)
   changed: (walked) from 471 to 554
   goals met: 6 of 15
44. (walk driver2 s4 p6-4)
   deleted: (at driver2 s4)
   added: (at driver2 p6-4)
   changed: (walked) from 554 to 634
   goals met: 5 of 15
45. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 5 of 15
46. (walk driver4 p9-7 s7)
   deleted: (at driver4 p9-7)
   added: (at driver4 s7)
   changed: (walked) from 634 to 673
   goals met: 6 of 15
47. (board-truck driver4 truck2 s7)
   deleted: (at driver4 s7) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 5 of 15
48. (drive-truck truck2 s7 s5 driver4)
   deleted: (at truck2 s7)
   added: (at truck2 s5)
   changed: (driven) from 864 to 962
   goals met: 5 of 15
49. (drive-truck truck2 s5 s4 driver4)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (driven) from 962 to 1054
   goals met: 6 of 15
50. (walk driver2 p6-4 s4)
   deleted: (at driver2 p6-4)
   added: (at driver2 s4)
   changed: (walked) from 673 to 753
   goals met: 7 of 15
51. (disembark-truck driver4 truck2 s4)
   deleted: (driving driver4 truck2)
   added: (at driver4 s4) (empty truck2)
   goals met: 7 of 15
52. (walk driver4 s4 p7-4)
   deleted: (at driver4 s4)
   added: (at driver4 p7-4)
   changed: (walked) from 753 to 831
   goals met: 7 of 15
53. (disembark-truck driver1 truck3 s3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s3) (empty truck3)
   goals met: 7 of 15
54. (walk driver2 s4 p6-4)
   deleted: (at driver2 s4)
   added: (at driver2 p6-4)
   changed: (walked) from 831 to 911
   goals met: 6 of 15
55. (walk driver4 p7-4 s7)
   deleted: (at driver4 p7-4)
   added: (at driver4 s7)
   changed: (walked) from 911 to 1010
   goals met: 7 of 15
56. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 7 of 15
57. (drive-truck truck3 s3 s0 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   changed: (driven) from 1054 to 1147
   goals met: 7 of 15
58. (drive-truck truck3 s0 s9 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s9)
   changed: (driven) from 1147 to 1186
   goals met: 7 of 15
59. (unload-truck package2 truck3 s9)
   deleted: (in package2 truck3)
   added: (at package2 s9)
   goals met: 8 of 15
60. (unload-truck package4 truck3 s9)
   deleted: (in package4 truck3)
   added: (at package4 s9)
   goals met: 9 of 15
61. (drive-truck truck3 s9 s0 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s0)
   changed: (driven) from 1186 to 1225
   goals met: 9 of 15
62. (disembark-truck driver1 truck3 s0)
   deleted: (driving driver1 truck3)
   added: (at driver1 s0) (empty truck3)
   goals met: 9 of 15
63. (board-truck driver3 truck3 s0)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 9 of 15
64. (walk driver2 p6-4 s4)
   deleted: (at driver2 p6-4)
   added: (at driver2 s4)
   changed: (walked) from 1010 to 1090
   goals met: 10 of 15
65. (drive-truck truck3 s0 s7 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s7)
   changed: (driven) from 1225 to 1275
   goals met: 10 of 15
66. (drive-truck truck3 s7 s2 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s2)
   changed: (driven) from 1275 to 1357
   goals met: 10 of 15
67. (unload-truck package7 truck3 s2)
   deleted: (in package7 truck3)
   added: (at package7 s2)
   goals met: 11 of 15
68. (drive-truck truck3 s2 s10 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s10)
   changed: (driven) from 1357 to 1395
   goals met: 11 of 15
69. (drive-truck truck3 s10 s3 driver3)
   deleted: (at truck3 s10)
   added: (at truck3 s3)
   changed: (driven) from 1395 to 1427
   goals met: 11 of 15
70. (disembark-truck driver3 truck3 s3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s3) (empty truck3)
   goals met: 12 of 15
71. (walk driver2 s4 p6-4)
   deleted: (at driver2 s4)
   added: (at driver2 p6-4)
   changed: (walked) from 1090 to 1170
   goals met: 11 of 15
72. (walk driver2 p6-4 s6)
   deleted: (at driver2 p6-4)
   added: (at driver2 s6)
   changed: (walked) from 1170 to 1241
   goals met: 11 of 15
73. (board-truck driver3 truck3 s3)
   deleted: (at driver3 s3) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 10 of 15
74. (board-truck driver2 truck5 s6)
   deleted: (at driver2 s6) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 10 of 15
75. (drive-truck truck5 s6 s7 driver2)
   deleted: (at truck5 s6)
   added: (at truck5 s7)
   changed: (driven) from 1427 to 1525
   goals met: 11 of 15
76. (drive-truck truck5 s7 s10 driver2)
   deleted: (at truck5 s7)
   added: (at truck5 s10)
   changed: (driven) from 1525 to 1589
   goals met: 10 of 15
77. (disembark-truck driver3 truck3 s3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s3) (empty truck3)
   goals met: 11 of 15
78. (unload-truck package9 truck3 s3)
   deleted: (in package9 truck3)
   added: (at package9 s3)
   goals met: 11 of 15
79. (board-truck driver3 truck3 s3)
   deleted: (at driver3 s3) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 10 of 15
80. (drive-truck truck3 s3 s6 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s6)
   changed: (driven) from 1589 to 1663
   goals met: 10 of 15
81. (unload-truck package6 truck3 s6)
   deleted: (in package6 truck3)
   added: (at package6 s6)
   goals met: 11 of 15
82. (drive-truck truck3 s6 s3 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   changed: (driven) from 1663 to 1737
   goals met: 11 of 15
83. (drive-truck truck5 s10 s4 driver2)
   deleted: (at truck5 s10)
   added: (at truck5 s4)
   changed: (driven) from 1737 to 1791
   goals met: 11 of 15
84. (load-truck package9 truck3 s3)
   deleted: (at package9 s3)
   added: (in package9 truck3)
   goals met: 11 of 15
85. (drive-truck truck3 s3 s0 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   changed: (driven) from 1791 to 1884
   goals met: 11 of 15
86. (drive-truck truck3 s0 s9 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s9)
   changed: (driven) from 1884 to 1923
   goals met: 11 of 15
87. (unload-truck package9 truck3 s9)
   deleted: (in package9 truck3)
   added: (at package9 s9)
   goals met: 12 of 15
88. (drive-truck truck3 s9 s0 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s0)
   changed: (driven) from 1923 to 1962
   goals met: 12 of 15
89. (drive-truck truck3 s0 s3 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   changed: (driven) from 1962 to 2055
   goals met: 12 of 15
90. (disembark-truck driver3 truck3 s3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s3) (empty truck3)
   goals met: 13 of 15
91. (drive-truck truck5 s4 s5 driver2)
   deleted: (at truck5 s4)
   added: (at truck5 s5)
   changed: (driven) from 2055 to 2147
   goals met: 13 of 15
92. (drive-truck truck5 s5 s7 driver2)
   deleted: (at truck5 s5)
   added: (at truck5 s7)
   changed: (driven) from 2147 to 2245
   goals met: 14 of 15
93. (disembark-truck driver2 truck5 s7)
   deleted: (driving driver2 truck5)
   added: (at driver2 s7) (empty truck5)
   goals met: 14 of 15
94. (walk driver2 s7 p7-4)
   deleted: (at driver2 s7)
   added: (at driver2 p7-4)
   changed: (walked) from 1241 to 1340
   goals met: 14 of 15
95. (walk driver2 p7-4 s4)
   deleted: (at driver2 p7-4)
   added: (at driver2 s4)
   changed: (walked) from 1340 to 1418
   goals met: 15 of 15
